tutorials/consistentSolvers/consistentSimpleFoam/cavityBlock/system/controlDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object controlDict;
}

application consistentSimpleFoam;

startFrom startTime;

startTime 0;

stopAt endTime;

endTime 1000;

deltaT 1;

writeControl timeStep;

writeInterval 100;

purgeWrite 2;

writeFormat ascii;

writePrecision 8;

writeCompression compressed;

timeFormat general;

timePrecision 6;

graphFormat raw;

runTimeModifiable no;

adjustTimeStep no;

maxCo 0.5;

maxDeltaT 0.25;
// ************************************************************************* //
